> length([])
0
> length(["a", "b"])
2
> length({"a" = "b"})
1
> length("hello")
5